<?php

class SuggestSeeder extends Seeder{

    public function run()
    {
        DB::table('suggest')->delete();

        Suggest::create(array(
            'name' => 'text1',
            'email' => '646840080@qq.com',
            'suggest' => '这是比较正常的信息这是比较正常的信息这是比较正常的信息这是比较正常的信息这是比较正常的信息'
        ));

        Suggest::create(array(
            'name' => '<h1>text2</h1>',
            'email' => '646840080@qq.com',
            'suggest' => '<h1>这是含html的信息</h1><h2>xxxxxxx</h2>'
        ));

        Suggest::create(array(
            'name' => '<h1>text3</h1>',
            'email' => '646840080@qq.com',
            'suggest' => '<h1>这是内容超长信息这是内容超长信息这是内容超长信息</h1><h2>xxxxxxx</h2>'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'.
                         '这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息这是内容超长信息'
        ));
    }
}
